In [2]:
library(dplyr)

Warning message:
"package 'dplyr' was built under R version 3.6.1"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [3]:
data=data.frame(
   id=1:10,
name=c("pappu","modi","saha","rahul","amit","narendra","sushma","imran","devansh","hd"),
class=sample(c("A","B","C"),10,replace=T))

In [4]:
game=data.frame(
id=sample(1:20,10),
game=sample(c("cricket","football","kabadi"),10,replace=T),
score=sample(40:100,10))

In [5]:
head(data)

  id name     class
1 1  pappu    C
2 2  modi     A
3 3  saha     A
4 4  rahul    C
5 5  amit     C
6 6  narendra C

In [6]:
ddf=merge(data,game,by="id")

In [7]:
ddf

  id name    class game     score
1  2 modi    A     football 60
2  5 amit    C     cricket  61
3  7 sushma  C     football 69
4  8 imran   C     cricket  97
5  9 devansh C     kabadi   84
6 10 hd      C     cricket  45

In [8]:
select(ddf,name,score)

  name    score
1 modi    60
2 amit    61
3 sushma  69
4 imran   97
5 devansh 84
6 hd      45

In [9]:
select(ddf,-id,-name)

  class game     score
1 A     football 60
2 C     cricket  61
3 C     football 69
4 C     cricket  97
5 C     kabadi   84
6 C     cricket  45

In [10]:
library(ggplot2)

In [11]:
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

In [12]:
head(select(mpg,cty,hwy,displ))

  cty hwy displ
1 18  29  1.8
2 21  29  1.8
3 20  31  2.0
4 21  30  2.0
5 16  26  2.8
6 18  26  2.8

In [13]:
head(game)

  id game     score
1 14 football 99
2  2 football 60
3  5 cricket  61
4 15 kabadi   46
5  8 cricket  97
6  7 football 69

In [14]:
filter(game,score>90)

  id game     score
1 14 football 99
2  8 cricket  97

In [15]:
filter(game,score>70,game=="cricket")

  id game    score
1 8  cricket 97

In [16]:
head(iris)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa
3 4.7          3.2         1.3          0.2         setosa
4 4.6          3.1         1.5          0.2         setosa
5 5.0          3.6         1.4          0.2         setosa
6 5.4          3.9         1.7          0.4         setosa

In [17]:
head(select(iris,Sepal.Length,Species))

  Sepal.Length Species
1 5.1          setosa
2 4.9          setosa
3 4.7          setosa
4 4.6          setosa
5 5.0          setosa
6 5.4          setosa

In [18]:
head(filter(iris,Sepal.Length>5))

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 5.4          3.9         1.7          0.4         setosa
3 5.4          3.7         1.5          0.2         setosa
4 5.8          4.0         1.2          0.2         setosa
5 5.7          4.4         1.5          0.4         setosa
6 5.4          3.9         1.3          0.4         setosa

In [19]:
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

In [20]:

mpg1=(filter(mpg,cty>20,hwy>25))
head(select(mpg1,manufacturer,displ))

  manufacturer displ
1 audi         1.8
2 audi         2.0
3 chevrolet    2.4
4 honda        1.6
5 honda        1.6
6 honda        1.6

In [21]:
data$maths=sample(40:100,10)
data$sci=sample(40:100,10)
data$other=sample(40:100,10)

In [22]:
head(data)

  id name     class maths sci other
1 1  pappu    C     72    75  48
2 2  modi     A     65    73  68
3 3  saha     A     83    49  69
4 4  rahul    C     69    92  86
5 5  amit     C     66    57  71
6 6  narendra C     75    99  88

In [23]:
data=mutate(data,percentage=(maths+sci+other)/3)

In [24]:
head(data)

  id name     class maths sci other percentage
1 1  pappu    C     72    75  48    65.00000
2 2  modi     A     65    73  68    68.66667
3 3  saha     A     83    49  69    67.00000
4 4  rahul    C     69    92  86    82.33333
5 5  amit     C     66    57  71    64.66667
6 6  narendra C     75    99  88    87.33333

##### SORT

In [25]:
x=sample(10:100,40)

In [26]:
x

 [1] 76 68 17 79 53 28 47 25 95 36 97 41 35 16 96 15 75 39 92 11 14 65 56 93 34
[26] 77 12 89 40 99 38 26 51 23 49 27 90 83 57 85

In [27]:
sort(x)

 [1] 11 12 14 15 16 17 23 25 26 27 28 34 35 36 38 39 40 41 47 49 51 53 56 57 65
[26] 68 75 76 77 79 83 85 89 90 92 93 95 96 97 99

In [28]:
sort(x,decreasing = T)

 [1] 99 97 96 95 93 92 90 89 85 83 79 77 76 75 68 65 57 56 53 51 49 47 41 40 39
[26] 38 36 35 34 28 27 26 25 23 17 16 15 14 12 11

In [29]:
sort(x,decreasing = F)

 [1] 11 12 14 15 16 17 23 25 26 27 28 34 35 36 38 39 40 41 47 49 51 53 56 57 65
[26] 68 75 76 77 79 83 85 89 90 92 93 95 96 97 99

In [30]:
x=sample(20:30,5)
x

[1] 20 24 22 21 26

In [31]:
order(x)

[1] 1 4 3 2 5

In [32]:
order(-x)

[1] 5 2 3 4 1

In [33]:
x[order(-x)]

[1] 26 24 22 21 20

In [34]:
data[7,4]=93

In [35]:
arrange(data,-maths,-sci)

   id name     class maths sci other percentage
1  10 hd       C     93    93  80    88.66667
2   7 sushma   C     93    51  40    61.66667
3   3 saha     A     83    49  69    67.00000
4   6 narendra C     75    99  88    87.33333
5   1 pappu    C     72    75  48    65.00000
6   4 rahul    C     69    92  86    82.33333
7   8 imran    C     68    42  90    66.66667
8   9 devansh  C     67    79  82    76.00000
9   5 amit     C     66    57  71    64.66667
10  2 modi     A     65    73  68    68.66667

##### redirection sign (%>%)

In [36]:
data %>% head()

  id name     class maths sci other percentage
1 1  pappu    C     72    75  48    65.00000
2 2  modi     A     65    73  68    68.66667
3 3  saha     A     83    49  69    67.00000
4 4  rahul    C     69    92  86    82.33333
5 5  amit     C     66    57  71    64.66667
6 6  narendra C     75    99  88    87.33333

In [37]:
data %>% select(name,maths,sci) %>% filter(maths>70,sci>60)

  name     maths sci
1 pappu    72    75
2 narendra 75    99
3 hd       93    93

In [38]:
head(game)

  id game     score
1 14 football 99
2  2 football 60
3  5 cricket  61
4 15 kabadi   46
5  8 cricket  97
6  7 football 69

In [40]:
game %>% group_by(game) %>% summarise (median=median(score),mean=mean(score),n=n())

  game     median mean  n
1 cricket  59.0   65.00 4
2 football 64.5   70.75 4
3 kabadi   65.0   65.00 2

In [41]:
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

In [49]:
p=mpg %>% select (manufacturer,cty,hwy)%>% group_by(manufacturer) %>% summarise (meancty=mean(cty),meanhwy=mean(hwy),n=n()) %>% arrange(-meancty,-meanhwy)

In [50]:
head(p)

  manufacturer meancty  meanhwy  n
1 honda        24.44444 32.55556  9
2 volkswagen   20.92593 29.22222 27
3 subaru       19.28571 25.57143 14
4 hyundai      18.64286 26.85714 14
5 toyota       18.52941 24.91176 34
6 nissan       18.07692 24.61538 13

In [51]:
head(game,3)

  id game     score
1 14 football 99
2  2 football 60
3  5 cricket  61

In [52]:
inner_join(data,game,by="id")

  id name    class maths sci other percentage game     score
1  2 modi    A     65    73  68    68.66667   football 60
2  5 amit    C     66    57  71    64.66667   cricket  61
3  7 sushma  C     93    51  40    61.66667   football 69
4  8 imran   C     68    42  90    66.66667   cricket  97
5  9 devansh C     67    79  82    76.00000   kabadi   84
6 10 hd      C     93    93  80    88.66667   cricket  45

In [53]:
left_join(data,game,by="id")

   id name     class maths sci other percentage game     score
1   1 pappu    C     72    75  48    65.00000   NA       NA
2   2 modi     A     65    73  68    68.66667   football 60
3   3 saha     A     83    49  69    67.00000   NA       NA
4   4 rahul    C     69    92  86    82.33333   NA       NA
5   5 amit     C     66    57  71    64.66667   cricket  61
6   6 narendra C     75    99  88    87.33333   NA       NA
7   7 sushma   C     93    51  40    61.66667   football 69
8   8 imran    C     68    42  90    66.66667   cricket  97
9   9 devansh  C     67    79  82    76.00000   kabadi   84
10 10 hd       C     93    93  80    88.66667   cricket  45

In [54]:
right_join(data,game,by="id")

   id name    class maths sci other percentage game     score
1  14 NA      NA    NA    NA  NA          NA   football 99
2   2 modi    A     65    73  68    68.66667   football 60
3   5 amit    C     66    57  71    64.66667   cricket  61
4  15 NA      NA    NA    NA  NA          NA   kabadi   46
5   8 imran   C     68    42  90    66.66667   cricket  97
6   7 sushma  C     93    51  40    61.66667   football 69
7  17 NA      NA    NA    NA  NA          NA   football 55
8   9 devansh C     67    79  82    76.00000   kabadi   84
9  10 hd      C     93    93  80    88.66667   cricket  45
10 13 NA      NA    NA    NA  NA          NA   cricket  57

In [57]:
full_join(data,game,by="id")

   id name     class maths sci other percentage game     score
1   1 pappu    C     72    75  48    65.00000   NA       NA
2   2 modi     A     65    73  68    68.66667   football 60
3   3 saha     A     83    49  69    67.00000   NA       NA
4   4 rahul    C     69    92  86    82.33333   NA       NA
5   5 amit     C     66    57  71    64.66667   cricket  61
6   6 narendra C     75    99  88    87.33333   NA       NA
7   7 sushma   C     93    51  40    61.66667   football 69
8   8 imran    C     68    42  90    66.66667   cricket  97
9   9 devansh  C     67    79  82    76.00000   kabadi   84
10 10 hd       C     93    93  80    88.66667   cricket  45
11 14 NA       NA    NA    NA  NA          NA   football 99
12 15 NA       NA    NA    NA  NA          NA   kabadi   46
13 17 NA       NA    NA    NA  NA          NA   football 55
14 13 NA       NA    NA    NA  NA          NA   cricket  57

In [73]:
test1=data.frame(
name=c("ram","shyam","ghanshyam","hari"),
math=sample(40:100,4),
sci=sample(40:100,4))

test2=data.frame(
name=c("ram","shyam","ghanshyam","hari"),
math=sample(40:100,4),
sci=sample(40:100,4))

In [74]:
test1

  name      math sci
1 ram       81   87
2 shyam     56   74
3 ghanshyam 76   86
4 hari      95   62

In [75]:
test2

  name      math sci
1 ram       76   100
2 shyam     97    47
3 ghanshyam 41    45
4 hari      54    86

In [79]:
test2[2,2]=56
test2[2,3]=74

In [80]:
intersect(test1,test2)

  name  math sci
1 shyam 56   74

In [ ]:
library(RSQ)

In [81]:
data()

In [83]:
head(data)

  id name     class maths sci other percentage
1 1  pappu    C     72    75  48    65.00000
2 2  modi     A     65    73  68    68.66667
3 3  saha     A     83    49  69    67.00000
4 4  rahul    C     69    92  86    82.33333
5 5  amit     C     66    57  71    64.66667
6 6  narendra C     75    99  88    87.33333

In [84]:
install.packages("RMySQL")

Installing package into 'C:/Users/user/Documents/R/win-library/3.6'
(as 'lib' is unspecified)

package 'RMySQL' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\user\AppData\Local\Temp\RtmpCKx4bg\downloaded_packages

In [85]:
library(RMySQL)

Warning message:
"package 'RMySQL' was built under R version 3.6.1"Loading required package: DBI

In [90]:
conn=dbConnect(MySQL(),host="localhost",user="root",password="",dbname="shail")

In [92]:
dbGetQuery(conn,"select * from new1")

  fname lname email                        password
1 shail
2 shail saini shailsinghadiya456@gmail.com mtbfight
3 shail saini shailsinghadiya456@gmail.com mtbfight
  pic
1
2 C:UsersuserDocuments\new1.html
3 C:UsersuserDocuments\new.html

In [93]:
data

   id name     class maths sci other percentage
1   1 pappu    C     72    75  48    65.00000
2   2 modi     A     65    73  68    68.66667
3   3 saha     A     83    49  69    67.00000
4   4 rahul    C     69    92  86    82.33333
5   5 amit     C     66    57  71    64.66667
6   6 narendra C     75    99  88    87.33333
7   7 sushma   C     93    51  40    61.66667
8   8 imran    C     68    42  90    66.66667
9   9 devansh  C     67    79  82    76.00000
10 10 hd       C     93    93  80    88.66667

In [94]:
dbWriteTable(conn,"info",data)

[1] TRUE

In [95]:
dbWriteTable(conn,"iris",iris)

[1] TRUE

In [96]:
dbWriteTable(conn,"mpg",mpg)

[1] TRUE

In [97]:
dbCommit(conn)

[1] TRUE

In [98]:
dbDisconnect(conn)

[1] TRUE

In [99]:
write.csv(iris,file="iris.csv")

In [100]:
x=read.csv("iris.csv")

In [102]:
head(x)

  X Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 1 5.1          3.5         1.4          0.2         setosa
2 2 4.9          3.0         1.4          0.2         setosa
3 3 4.7          3.2         1.3          0.2         setosa
4 4 4.6          3.1         1.5          0.2         setosa
5 5 5.0          3.6         1.4          0.2         setosa
6 6 5.4          3.9         1.7          0.4         setosa